In [11]:
import pandas as pd

In [12]:
df = pd.read_csv("../input/oil.csv")

In [13]:
df.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [14]:
df.dtypes

date           object
dcoilwtico    float64
dtype: object

In [15]:
df.shape

(1218, 2)

In [16]:
df["dcoilwtico"].isna().sum()

43

In [17]:
df["dcoilwtico"].mean()

67.71436595744682

In [18]:
df["dcoilwtico"].fillna(df["dcoilwtico"].mean(),inplace= True)

C:\Users\sebas\AppData\Local\Temp\ipykernel_23024\1550425128.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["dcoilwtico"].fillna(df["dcoilwtico"].mean(),inplace= True)

In [19]:
df.head()

         date  dcoilwtico
0  2013-01-01   67.714366
1  2013-01-02   93.140000
2  2013-01-03   92.970000
3  2013-01-04   93.120000
4  2013-01-07   93.200000

In [20]:
df["dcoilwtico"].mean()

67.71436595744682

In [21]:
df.dtypes

date           object
dcoilwtico    float64
dtype: object

In [22]:
df["date"] = pd.to_datetime(df["date"])

In [23]:
df.dtypes

date          datetime64[ns]
dcoilwtico           float64
dtype: object

In [24]:
df.head()

        date  dcoilwtico
0 2013-01-01   67.714366
1 2013-01-02   93.140000
2 2013-01-03   92.970000
3 2013-01-04   93.120000
4 2013-01-07   93.200000

In [25]:
df

           date  dcoilwtico
0    2013-01-01   67.714366
1    2013-01-02   93.140000
2    2013-01-03   92.970000
3    2013-01-04   93.120000
4    2013-01-07   93.200000
...         ...         ...
1213 2017-08-25   47.650000
1214 2017-08-28   46.400000
1215 2017-08-29   46.460000
1216 2017-08-30   45.960000
1217 2017-08-31   47.260000

[1218 rows x 2 columns]

In [26]:
df.loc[(df["date"]>="2013-01-01")&(df["date"]<="2013-12-31")]

          date  dcoilwtico
0   2013-01-01   67.714366
1   2013-01-02   93.140000
2   2013-01-03   92.970000
3   2013-01-04   93.120000
4   2013-01-07   93.200000
..         ...         ...
256 2013-12-25   67.714366
257 2013-12-26   99.180000
258 2013-12-27   99.940000
259 2013-12-30   98.900000
260 2013-12-31   98.170000

[261 rows x 2 columns]

In [27]:
df.set_index("date", inplace = True)

In [28]:
df.head()

            dcoilwtico
date
2013-01-01   67.714366
2013-01-02   93.140000
2013-01-03   92.970000
2013-01-04   93.120000
2013-01-07   93.200000

In [29]:
df.loc["2013-01-01":"2013-01-31"]

            dcoilwtico
date
2013-01-01   67.714366
2013-01-02   93.140000
2013-01-03   92.970000
2013-01-04   93.120000
2013-01-07   93.200000
2013-01-08   93.210000
2013-01-09   93.080000
2013-01-10   93.810000
2013-01-11   93.600000
2013-01-14   94.270000
2013-01-15   93.260000
2013-01-16   94.280000
2013-01-17   95.490000
2013-01-18   95.610000
2013-01-21   67.714366
2013-01-22   96.090000
2013-01-23   95.060000
2013-01-24   95.350000
2013-01-25   95.150000
2013-01-28   95.950000
2013-01-29   97.620000
2013-01-30   97.980000
2013-01-31   97.650000